In [1]:

%matplotlib inline

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/alexeygrigorev/datasets/master/course_lead_scoring.csv')

In [3]:
df.head()

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,paid_ads,NaN,1,79450.0,unemployed,south_america,4,0.94,1
1,social_media,retail,1,46992.0,employed,south_america,1,0.80,0
2,events,healthcare,5,78796.0,unemployed,australia,3,0.69,1
3,paid_ads,retail,2,83843.0,NaN,australia,1,0.87,0
4,referral,education,3,85012.0,self_employed,europe,3,0.62,1

In [4]:
df.describe()

,number_of_courses_viewed,annual_income,interaction_count,lead_score,converted
count,1462.000000,1281.000000,1462.000000,1462.000000,1462.000000
mean,2.031464,59886.273224,2.976744,0.506108,0.619015
std,1.449717,15070.140389,1.681564,0.288465,0.485795
min,0.000000,13929.000000,0.000000,0.000000,0.000000
25%,1.000000,49698.000000,2.000000,0.262500,0.000000
50%,2.000000,60148.000000,3.000000,0.510000,1.000000
75%,3.000000,69639.000000,4.000000,0.750000,1.000000
max,9.000000,109899.000000,11.000000,1.000000,1.000000

In [5]:
df.dtypes

lead_source                  object
industry                     object
number_of_courses_viewed      int64
annual_income               float64
employment_status            object
location                     object
interaction_count             int64
lead_score                  float64
converted                     int64
dtype: object

In [6]:
for col in df.columns:
    print(col)
    print(df[col].nunique(), df[col].unique())
    print(df[col].isnull().sum())
    print()

lead_source
5 ['paid_ads' 'social_media' 'events' 'referral' 'organic_search' nan]
128

industry
7 [nan 'retail' 'healthcare' 'education' 'manufacturing' 'technology'
 'other' 'finance']
134

number_of_courses_viewed
10 [1 5 2 3 0 4 6 8 7 9]
0

annual_income
1267 [79450. 46992. 78796. ... 45688. 71016. 92855.]
181

employment_status
4 ['unemployed' 'employed' nan 'self_employed' 'student']
100

location
7 ['south_america' 'australia' 'europe' 'africa' 'middle_east' nan
 'north_america' 'asia']
63

interaction_count
12 [ 4  1  3  6  2  0  5  7  9  8 10 11]
0

lead_score
101 [0.94 0.8  0.69 0.87 0.62 0.83 0.57 0.86 0.43 0.92 0.97 0.71 0.75 0.64
 0.74 0.51 0.33 0.2  0.6  0.49 0.55 0.68 0.63 0.82 0.48 0.54 0.46 0.26
 0.9  0.79 0.21 0.52 0.81 0.06 0.1  0.02 0.15 0.27 0.08 0.76 0.88 0.11
 0.32 0.91 0.42 0.95 0.85 0.34 0.78 0.13 0.23 0.98 0.7  0.18 0.19 0.72
 0.12 0.37 1.   0.38 0.61 0.04 0.5  0.35 0.24 0.3  0.58 0.96 0.22 0.
 0.44 0.05 0.39 0.41 0.99 0.45 0.89 0.25 0.4  0.56 0.01 0.17 0.53 0.03
 0.09 0.29 0.47 0.16 0.31 0.14 0.36 0.28 0.73 0.66 0.84 0.67 0.59 0.07
 0.93 0.65 0.77]
0

converted
2 [1 0]
0

In [7]:
df.industry.value_counts()

industry
retail           203
finance          200
other            198
education        187
healthcare       187
technology       179
manufacturing    174
Name: count, dtype: int64

In [8]:
df.industry.isnull().sum()

np.int64(134)

In [9]:
df.industry.fillna("NA")

0                  NA
1              retail
2          healthcare
3              retail
4           education
            ...
1457    manufacturing
1458       technology
1459       technology
1460               NA
1461          finance
Name: industry, Length: 1462, dtype: object

In [10]:
fdf = df.fillna({'industry': 'NA',
            'employment_status': 'NA',
            'location': 'NA',
            'lead_source': 'NA',
            'annual_income': 0.0,
            })

In [11]:
fdf.isnull().sum()

lead_source                 0
industry                    0
number_of_courses_viewed    0
annual_income               0
employment_status           0
location                    0
interaction_count           0
lead_score                  0
converted                   0
dtype: int64

In [12]:
fdf.industry.value_counts()

industry
retail           203
finance          200
other            198
healthcare       187
education        187
technology       179
manufacturing    174
NA               134
Name: count, dtype: int64

In [13]:
fdf.interaction_count.corrwith

AttributeError: 'Series' object has no attribute 'corrwith'